app/controllers/articles_controller.rb

  def create
    @article = Article.new(params.require(:article).permit(:title, :description))

    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "edit"], ["description", "edit"], ["created_at", "2023-02-08 21:23:50.142671"], ["updated_at", "2023-02-08 21:23:50.142671"]]

  def update
    @article = Article.find(params[:id])
    if @article.update(params.require(:article).permit(:title, :description))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "check edit id 1"], ["description", "id 1 edited"], ["updated_at", "2023-02-08 21:35:35.461542"], ["id", 1]]